app/controllers/app/flights_controller.rb

SELECT "flights".* FROM "flights"
---
  def index
    @flights = Flight.all