app/controllers/app/planes_controller.rb

SELECT "planes".* FROM "planes"
---
  def index
    @planes = Plane.all

SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT 1
---
    def set_plane
      @plane = Plane.find(params[:id])