app/controllers/application_controller.rb

  def authenticate
    @current_user = User.find_by :id => session[:user_id] if session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1